ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0xC</addressOffset>
        <description>Watchdog timer value register. This register reads out the current value of the Watchdog timer.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x18</bitWidth>
            <description>Counter timer value.</description>
            <name>Count</name>
          </field>
        </fields>
        <name>WDTV</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFF</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x14</addressOffset>
        <description>Watchdog Warning Interrupt compare value.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0xA</bitWidth>
            <description>Watchdog warning interrupt compare value.</description>
            <name>WARNINT</name>
          </field>
        </fields>
        <name>WDWARNINT</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x18</addressOffset>
        <description>Watchdog Window compare value.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x18</bitWidth>
            <description>Watchdog window value.</description>
            <name>WINDOW</name>
          </field>
        </fields>
        <name>WDWINDOW</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFFFFFF</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <addressBlock>
      <offset>0x0</offset>
      <size>0xFFF</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40008000</baseAddress>
    <description>UART</description>
    <groupName>UART</groupName>
    <interrupts>
      <interrupt>
        <name>UART</name>
        <value>0x15</value>
      </interrupt>
    </interrupts>
    <name>UART</name>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x0</addressOffset>
        <description>Receiver Buffer Register. Contains the next received character to be read. (DLAB=0)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>The UART Receiver Buffer Register contains the oldest received byte in the UART RX FIFO.</description>
            <name>RBR</name>
          </field>
        </fields>
        <name>RBR</name>
        <readAction>modify</readAction>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>write-only</access>
        <addressOffset>0x0</addressOffset>
        <description>Transmit Holding Register. The next character to be transmitted is written here. (DLAB=0)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Writing to the UART Transmit Holding Register causes the data to be stored in the UART transmit FIFO. The byte will be sent when it reaches the bottom of the FIFO and the transmitter is available.</description>
            <name>THR</name>
          </field>
        </fields>
        <name>THR</name>
        <readAction>modify</readAction>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>The UART Divisor Latch LSB Register, along with the DLM register, determines the baud rate of the UART.</description>
            <name>DLLSB</name>
          </field>
        </fields>
        <name>DLL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>The UART Divisor Latch MSB Register, along with the DLL register, determines the baud rate of the UART.</description>
            <name>DLMSB</name>
          </field>
        </fields>
        <name>DLM</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART interrupts. (DLAB=0)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RBR Interrupt Enable. Enables the Receive Data Available interrupt for UART. It also controls the Character Receive Time-out interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the RDA interrupt.</description>
                <name>DISABLE_THE_RDA_INTE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the RDA interrupt.</description>
                <name>ENABLE_THE_RDA_INTER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RBRIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>THRE Interrupt Enable. Enables the THRE interrupt for UART. The status of this interrupt can be read from LSR[5].</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the THRE interrupt.</description>
                <name>DISABLE_THE_THRE_INT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the THRE interrupt.</description>
                <name>ENABLE_THE_THRE_INTE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>THREIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RX Line Interrupt Enable. Enables the UART RX line status interrupts. The status of this interrupt can be read from LSR[4:1].</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the RX line status interrupts.</description>
                <name>DISABLE_THE_RX_LINE_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the RX line status interrupts.</description>
                <name>ENABLE_THE_RX_LINE_S</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RXLIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the end of auto-baud interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable end of auto-baud Interrupt.</description>
                <name>DISABLE_END_OF_AUTO_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable end of auto-baud Interrupt.</description>
                <name>ENABLE_END_OF_AUTO_B</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ABEOINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the auto-baud time-out interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable auto-baud time-out Interrupt.</description>
                <name>DISABLE_AUTO_BAUD_TI</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable auto-baud time-out Interrupt.</description>
                <name>ENABLE_AUTO_BAUD_TIM</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ABTOINTEN</name>
          </field>
        </fields>
        <name>IER</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
