ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x8</addressOffset>
        <description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt status. Note that IIR[0] is active low. The pending interrupt can be determined by evaluating IIR[3:1].</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>At least one interrupt is pending.</description>
                <name>PENDING</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>No interrupt is pending.</description>
                <name>NO_INTERRUPT_IS_PEND</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>INTSTATUS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Interrupt identification. IER[3:1] identifies an interrupt corresponding to the UART Rx FIFO. All other combinations of IER[3:1] not listed below are reserved (100,101,111).</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>1   - Receive Line Status (RLS).</description>
                <name>1_RECEIVE_LINE_S</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2a - Receive Data Available (RDA).</description>
                <name>2A__RECEIVE_DATA_AV</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2b - Character Time-out Indicator (CTI).</description>
                <name>2B__CHARACTER_TIME_</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>3   - THRE Interrupt.</description>
                <name>3_THRE_INTERRUPT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>4   - Modem interrupt.</description>
                <name>4_MODEM_INTERRUP</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>INTID</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>These bits are equivalent to FCR[0].</description>
            <name>FIFOENABLE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>End of auto-baud interrupt. True if auto-baud has finished successfully and interrupt is enabled.</description>
            <name>ABEOINT</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Auto-baud time-out interrupt. True if auto-baud has timed out and interrupt is enabled.</description>
            <name>ABTOINT</name>
          </field>
        </fields>
        <name>IIR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>write-only</access>
        <addressOffset>0x8</addressOffset>
        <description>FIFO Control Register. Controls UART FIFO usage and modes.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>FIFO Enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>UART FIFOs are disabled. Must not be used in the application.</description>
                <name>DISABLED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Active high enable for both UART Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper UART operation. Any transition on this bit will automatically clear the UART FIFOs.</description>
                <name>ENABLED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FIFOEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RX FIFO Reset</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No impact on either of UART FIFOs.</description>
                <name>NO_IMPACT_ON_EITHER_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Writing a logic 1 to FCR[1] will clear all bytes in UART Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RXFIFORES</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>TX FIFO Reset</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No impact on either of UART FIFOs.</description>
                <name>NO_IMPACT_ON_EITHER_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Writing a logic 1 to FCR[2] will clear all bytes in UART TX FIFO, reset the pointer logic. This bit is self-clearing.</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>TXFIFORES</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>RX Trigger Level. These two bits determine how many receiver UART FIFO characters must be written before an interrupt is activated.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Trigger level 0 (1 character or 0x01).</description>
                <name>TRIGGER_LEVEL_0_1_C</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Trigger level 1 (4 characters or 0x04).</description>
                <name>TRIGGER_LEVEL_1_4_C</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Trigger level 2 (8 characters or 0x08).</description>
                <name>TRIGGER_LEVEL_2_8_C</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Trigger level 3 (14 characters or 0x0E).</description>
                <name>TRIGGER_LEVEL_3_14_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RXTL</name>
          </field>
        </fields>
        <name>FCR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
