ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <description>Line Control Register. Contains controls for frame formatting and break generation.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Word Length Select</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>5-bit character length.</description>
                <name>5_BIT_CHARACTER_LENG</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>6-bit character length.</description>
                <name>6_BIT_CHARACTER_LENG</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>7-bit character length.</description>
                <name>7_BIT_CHARACTER_LENG</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>8-bit character length.</description>
                <name>8_BIT_CHARACTER_LENG</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>WLS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Stop Bit Select</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>1 stop bit.</description>
                <name>1_STOP_BIT_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2 stop bits (1.5 if LCR[1:0]=00).</description>
                <name>2_STOP_BITS</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SBS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Parity Enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable parity generation and checking.</description>
                <name>DISABLE_PARITY_GENER</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable parity generation and checking.</description>
                <name>ENABLE_PARITY_GENERA</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Parity Select</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</description>
                <name>ODD_PARITY_NUMBER_O</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</description>
                <name>EVEN_PARITY_NUMBER_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Forced 1 stick parity.</description>
                <name>FORCED_1_STICK_PARIT</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Forced 0 stick parity.</description>
                <name>FORCED_0_STICK_PARIT</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Break Control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable break transmission.</description>
                <name>DISABLE_BREAK_TRANSM</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable break transmission. Output pin UART TXD is forced to logic 0 when LCR[6] is active high.</description>
                <name>ENABLE_BREAK_TRANSMI</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>BC</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Divisor Latch Access Bit</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable access to Divisor Latches.</description>
                <name>DISABLE_ACCESS_TO_DI</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable access to Divisor Latches.</description>
                <name>ENABLE_ACCESS_TO_DIV</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DLAB</name>
          </field>
        </fields>
        <name>LCR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
