ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x70</addressOffset>
        <description>Count Control Register (CTCR). The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Counter/Timer Mode. This field selects which rising PCLK edges can increment Timer's Prescale Counter (PC), or clear PC and increment Timer Counter (TC). Timer Mode: every rising PCLK edge</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Timer Mode: every rising PCLK edge</description>
                <name>TIMERMODE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Counter Mode: TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>
                <name>RISINGEDGE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Counter Mode: TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>
                <name>FALLLINGEDGE</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Counter Mode: TC is incremented on both edges on the CAP input selected by bits 3:2.</description>
                <name>RISINGFALLINGEDGE</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CTM</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Count Input Select. When bits 1:0 in this register are not 00, these bits select which CAP pin is sampled for clocking.
            						Note: If Counter mode is selected in the TnCTCR, the 3 bits for that input in the Capture Control Register (TnCCR) must be programmed as 000.
            					</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>CT32Bn_CAP0</description>
                <name>CT32B_CAP0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CIS</name>
          </field>
        </fields>
        <name>CTCR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x74</addressOffset>
        <description>PWM Control Register (PWMCON). The PWMCON enables PWM mode for the external match pins CT32B0_MAT[3:0].</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PWM channel 0 enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>CT32Bn_MAT0 is controlled by EM0.</description>
                <name>EM0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>PWM mode is enabled for CT32Bn_MAT0.</description>
                <name>PWMMODE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PWMEN0</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PWM channel 1 enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>CT32Bn_MAT1 is controlled by EM1.</description>
                <name>EM1</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>PWM mode is enabled for CT32Bn_MAT1.</description>
                <name>PWMMODE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PWMEN1</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PWM channel 2 enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>CT32Bn_MAT2 is controlled by EM2.</description>
                <name>EM2</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>PWM mode is enabled for CT32Bn_MAT2.</description>
                <name>PWMMODE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PWMEN2</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PWM channel 3 enable Note: It is recommended to use match channel 3 to set the PWM cycle.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>CT32Bn_MAT3 is controlled by EM3.</description>
                <name>EM3</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>PWM mode is enabled for CT32Bn_MAT3.</description>
                <name>PPWMMODE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PWMEN3</name>
          </field>
        </fields>
        <name>PWMC</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
