ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x24</addressOffset>
        <description>A/D Channel n Data Register. This register contains the result of the most recent conversion completed on channel n.</description>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0xA</bitWidth>
            <description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin, divided by the voltage on the VREF pin. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VREF, while 0x3FF indicates that the voltage on AD input was close to, equal to, or greater than that on VREF.</description>
            <name>V_VREF</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1E</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits.This bit is cleared by reading this register.</description>
            <name>OVERRUN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1F</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
            <name>DONE</name>
          </field>
        </fields>
        <name>DR5</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>A/D Channel n Data Register. This register contains the result of the most recent conversion completed on channel n.</description>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0xA</bitWidth>
            <description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin, divided by the voltage on the VREF pin. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VREF, while 0x3FF indicates that the voltage on AD input was close to, equal to, or greater than that on VREF.</description>
            <name>V_VREF</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1E</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits.This bit is cleared by reading this register.</description>
            <name>OVERRUN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1F</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
            <name>DONE</name>
          </field>
        </fields>
        <name>DR6</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x2C</addressOffset>
        <description>A/D Channel n Data Register. This register contains the result of the most recent conversion completed on channel n.</description>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0xA</bitWidth>
            <description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin, divided by the voltage on the VREF pin. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VREF, while 0x3FF indicates that the voltage on AD input was close to, equal to, or greater than that on VREF.</description>
            <name>V_VREF</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1E</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits.This bit is cleared by reading this register.</description>
            <name>OVERRUN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1F</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
            <name>DONE</name>
          </field>
        </fields>
        <name>DR7</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <addressBlock>
      <offset>0x0</offset>
      <size>0xFFF</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40038000</baseAddress>
    <description>Power management unit</description>
    <groupName>PMU</groupName>
    <interrupts></interrupts>
    <name>PMU</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>Power control register</description>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Deep power-down mode enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>ARM WFI will enter Sleep or Deep-sleep mode (clock to ARM Cortex-M0 core turned off).</description>
                <name>SLEEPMODE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>ARM WFI will enter Deep-power down mode (ARM Cortex-M0 core powered-down).</description>
                <name>DEEPPOWERDOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DPDEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Sleep mode flag</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Read: No power-down mode entered. LPC111x/LPC11C1x is in Active mode. Write: No effect.</description>
                <name>NOPOWERDOWN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Read: Sleep/Deep-sleep or Deep power-down mode entered. Write: Writing a 1 clears the SLEEPFLAG bit to 0.</description>
                <name>POWERDOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SLEEPFLAG</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Deep power-down flag</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Read: Deep power-down mode  not entered. Write: No effect.</description>
                <name>NODEEPPOWERDOWN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Read: Deep power-down mode entered. Write: Clear the Deep power-down flag.</description>
                <name>DEEPPOWERDOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DPDFLAG</name>
          </field>
        </fields>
        <name>PCON</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
