ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x14</addressOffset>
        <description>General purpose register 4</description>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WAKEUP pin hysteresis enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Hysteresis for WAKEUP pin enabled.</description>
                <name>ENABLED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Hysteresis for WAKUP pin disabled.</description>
                <name>DISABLED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>WAKEUPHYS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x15</bitWidth>
            <description>Data retained during Deep power-down mode.</description>
            <name>GPDATA</name>
          </field>
        </fields>
        <name>GPREG4</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>General purpose register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x20</bitWidth>
            <description>Data retained during Deep power-down mode.</description>
            <name>GPDATA</name>
          </field>
        </fields>
        <name>GPREG0</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8</addressOffset>
        <description>General purpose register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x20</bitWidth>
            <description>Data retained during Deep power-down mode.</description>
            <name>GPDATA</name>
          </field>
        </fields>
        <name>GPREG1</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <description>General purpose register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x20</bitWidth>
            <description>Data retained during Deep power-down mode.</description>
            <name>GPDATA</name>
          </field>
        </fields>
        <name>GPREG2</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x10</addressOffset>
        <description>General purpose register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x20</bitWidth>
            <description>Data retained during Deep power-down mode.</description>
            <name>GPDATA</name>
          </field>
        </fields>
        <name>GPREG3</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <addressBlock>
      <offset>0x0</offset>
      <size>0xFFF</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x4003C000</baseAddress>
    <description>Flash programming firmware</description>
    <groupName>FLASHCTRL</groupName>
    <interrupts>
      <interrupt>
        <name>FMC</name>
        <value>0x1B</value>
      </interrupt>
    </interrupts>
    <name>FLASHCTRL</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x10</addressOffset>
        <description>Flash memory access time configuration register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Flash memory access time. FLASHTIM +1 is equal to the number of system clocks used for flash access.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>1 system clock flash access time (for system clock frequencies of up to 20 MHz).</description>
                <name>1_SYSTEM_CLOCK_FLASH</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2 system clocks flash access time (for system clock frequencies of up to 40 MHz).</description>
                <name>2_SYSTEM_CLOCKS_FLAS</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>3 system clocks flash access time (for system clock frequencies of up to 50 MHz).</description>
                <name>3_SYSTEM_CLOCKS_FLAS</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FLASHTIM</name>
          </field>
        </fields>
        <name>FLASHCFG</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x20</addressOffset>
        <description>Signature start address register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x11</bitWidth>
            <description>Signature generation start address (corresponds to AHB byte address bits[20:4]).</description>
            <name>START</name>
          </field>
        </fields>
        <name>FMSSTART</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
