ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x64</addressOffset>
        <description>I/O configuration for pin PIO0_9/MOSI0/CT16B0_MAT1</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects pin function. All other values are reserved.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function PIO0_9.</description>
                <name>PIO0_9</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function MOSI0.</description>
                <name>MOSI0</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function CT16B0_MAT1.</description>
                <name>CT16B0_MAT1</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FUNC</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                <name>INACTIVE_NO_PULL_DO</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Pull-down resistor enabled.</description>
                <name>PULL_DOWN_RESISTOR_E</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Pull-up resistor enabled.</description>
                <name>PULL_UP_RESISTOR_ENA</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Repeater mode.</description>
                <name>REPEATER_MODE_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MODE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Hysteresis.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable.</description>
                <name>DISABLE_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable.</description>
                <name>ENABLE_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>HYS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Selects pseudo open-drain mode.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Standard GPIO output</description>
                <name>STANDARD_GPIO_OUTPUT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Open-drain output</description>
                <name>OPEN_DRAIN_OUTPUT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>OD</name>
          </field>
        </fields>
        <name>PIO0_9</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xD0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x68</addressOffset>
        <description>I/O configuration for pin SWCLK/PIO0_10/ SCK0/CT16B0_MAT2</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects pin function. All other values are reserved.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function SWCLK.</description>
                <name>SWCLK</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function PIO0_10.</description>
                <name>PIO0_10</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function SCK0 (only if pin SWCLK/PIO0_10/SCK0/CT16B0_MAT2 selected in Table 147).</description>
                <name>SCK0</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function CT16B0_MAT2.</description>
                <name>CT16B0_MAT2</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FUNC</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                <name>INACTIVE_NO_PULL_DO</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Pull-down resistor enabled.</description>
                <name>PULL_DOWN_RESISTOR_E</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Pull-up resistor enabled.</description>
                <name>PULL_UP_RESISTOR_ENA</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Repeater mode.</description>
                <name>REPEATER_MODE_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MODE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Hysteresis.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable.</description>
                <name>DISABLE_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable.</description>
                <name>ENABLE_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>HYS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Selects pseudo open-drain mode.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Standard GPIO output</description>
                <name>STANDARD_GPIO_OUTPUT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Open-drain output</description>
                <name>OPEN_DRAIN_OUTPUT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>OD</name>
          </field>
        </fields>
        <name>SWCLK_PIO0_10</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xD0</resetValue>
        <size>0x20</size>
      </register>
