ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8C</addressOffset>
        <description>I/O configuration for pin PIO2_3/RI/MOSI1</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects pin function. All other values are reserved.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function PIO2_3.</description>
                <name>PIO2_3</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function RI.</description>
                <name>RI</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function MOSI1.</description>
                <name>MOSI1</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FUNC</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                <name>INACTIVE_NO_PULL_DO</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Pull-down resistor enabled.</description>
                <name>PULL_DOWN_RESISTOR_E</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Pull-up resistor enabled.</description>
                <name>PULL_UP_RESISTOR_ENA</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Repeater mode.</description>
                <name>REPEATER_MODE_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MODE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Hysteresis.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable.</description>
                <name>DISABLE_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable.</description>
                <name>ENABLE_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>HYS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Selects pseudo open-drain mode.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Standard GPIO output</description>
                <name>STANDARD_GPIO_OUTPUT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Open-drain output</description>
                <name>OPEN_DRAIN_OUTPUT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>OD</name>
          </field>
        </fields>
        <name>PIO2_3</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xD0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x90</addressOffset>
        <description>I/O configuration for pin SWDIO/PIO1_3/AD4/CT32B1_MAT2</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects pin function. All other values are reserved.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function SWDIO.</description>
                <name>SWDIO</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function PIO1_3.</description>
                <name>PIO1_3</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function AD4.</description>
                <name>AD4</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects function CT32B1_MAT2.</description>
                <name>CT32B1_MAT2</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FUNC</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                <name>INACTIVE_NO_PULL_DO</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Pull-down resistor enabled.</description>
                <name>PULL_DOWN_RESISTOR_E</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Pull-up resistor enabled.</description>
                <name>PULL_UP_RESISTOR_ENA</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Repeater mode.</description>
                <name>REPEATER_MODE_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MODE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Hysteresis.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable.</description>
                <name>DISABLE_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable.</description>
                <name>ENABLE_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>HYS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Selects Analog/Digital mode</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Analog input mode</description>
                <name>ANALOG_INPUT_MODE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Digital functional mode</description>
                <name>DIGITAL_FUNCTIONAL_M</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ADMODE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Selects pseudo open-drain mode.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Standard GPIO output</description>
                <name>STANDARD_GPIO_OUTPUT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Open-drain output</description>
                <name>OPEN_DRAIN_OUTPUT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>OD</name>
          </field>
        </fields>
        <name>SWDIO_PIO1_3</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xD0</resetValue>
        <size>0x20</size>
      </register>
