ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xB4</addressOffset>
        <description>DSR pin location select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects pin location for DSR function.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects  DSR function in pin location PIO2_1/DSR/SCK1 (see Table 113).</description>
                <name>PIO2_1</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects DSR function in pin location PIO3_1/DSR (see Table 137).</description>
                <name>PIO3_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DSRLOC</name>
          </field>
        </fields>
        <name>DSR_LOC</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xB8</addressOffset>
        <description>DCD pin location select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects pin location for DCD function.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects  DCD function in pin location PIO2_2/DCD/MISO1 (see  Table 126).</description>
                <name>PIO2_2</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects DCD function in pin location PIO3_2/DCD (see  Table 142).</description>
                <name>PIO3_2</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DCDLOC</name>
          </field>
        </fields>
        <name>DCD_LOC</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xBC</addressOffset>
        <description>RI pin location select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects pin location for RI function.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects  RI function in pin location PIO2_3/RI/MOSI1 (see Table 138).</description>
                <name>PIO2_3</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects RI function in pin location PIO3_3/RI (see Table 146).</description>
                <name>PIO3_3</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RILOC</name>
          </field>
        </fields>
        <name>RI_LOC</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x18</addressOffset>
        <description>SSEL1 pin location select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects pin location for SSEL1 function.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects SSEL1 function in pin location PIO2_2/DCD/MISO1 (see Table 126).</description>
                <name>PIO2_2</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects SSEL1 function in pin location  PIO2_4/CT16B1_MAT1/SSEL1 (see Table 119).</description>
                <name>PIO2_4</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SSEL1LOC</name>
          </field>
        </fields>
        <name>SSEL1_LOC</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
