ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC4</addressOffset>
        <description>SCK1 pin location select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects pin location for SCK1 function.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects SCK1 function in pin location PIO2_1/DSR/SCK1 (see Table 113).</description>
                <name>PIO2_1</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects SCK1 function in pin location PIO3_2/DCD/CT16B0_MAT2/SCK1 (see Table 142).</description>
                <name>PIO3_2</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SCK1LOC</name>
          </field>
        </fields>
        <name>SCK1_LOC</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC8</addressOffset>
        <description>MISO1 pin location select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects pin location for the MISO1 function.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects MISO1 function in pin location PIO2_2/DCD/MISO1 (see Table 126).</description>
                <name>PIO2_2</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects MISO1 function in pin location PIO1_10/AD6/CT16B1_MAT1/MISO1 (see  Table 130).</description>
                <name>PIO1_10</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MISO1LOC</name>
          </field>
        </fields>
        <name>MISO1_LOC</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xCC</addressOffset>
        <description>MOSI1 pin location select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects pin location for the MOSI1 function.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects MOSI1 function in pin location PIO2_3/RI/MOSI1 (see Table 138).</description>
                <name>PIO2_3</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects MOSI1 function in pin location PIO1_9/CT16B1_MAT0/MOSI1 (see Table 117).</description>
                <name>PIO1_9</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved.</description>
                <name>RESERVED_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MOSI1LOC</name>
          </field>
        </fields>
        <name>MOSI1_LOC</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xD4</addressOffset>
        <description>RXD pin location select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Selects pin location for the RXD function.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects RXD function in pin location PIO1_6/RXD/CT32B0_MAT0 (see Table 144).</description>
                <name>PIO1_6</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects RXD function in pin location PIO2_7/CT32B0_MAT2/RXD (see Table 111).</description>
                <name>PIO2_7</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects RXD function in pin location PIO3_1/DSR/CT16B0_MAT1/RXD (see Table 137).</description>
                <name>PIO3_1</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Selects RXD function in pin location PIO3_4/CT16B0_CAP1/RXD (see Table 118).</description>
                <name>PIO3_4</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RXDLOC</name>
          </field>
        </fields>
        <name>RXD_LOC</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
