ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <addressBlock>
      <offset>0x0</offset>
      <size>0xFFF</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40048000</baseAddress>
    <description>System configuration (SYSCON)</description>
    <groupName>SYSCON</groupName>
    <interrupts>
      <interrupt>
        <name>BOD</name>
        <value>0x1A</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_0</name>
        <value>0x0</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_1</name>
        <value>0x1</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_2</name>
        <value>0x2</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_3</name>
        <value>0x3</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_4</name>
        <value>0x4</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_5</name>
        <value>0x5</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_6</name>
        <value>0x6</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_7</name>
        <value>0x7</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_8</name>
        <value>0x8</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_9</name>
        <value>0x9</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_10</name>
        <value>0xA</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO0_11</name>
        <value>0xB</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>PIO1_0</name>
        <value>0xC</value>
      </interrupt>
    </interrupts>
    <name>SYSCON</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>System memory remap</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>System memory remap</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
                <name>BOOT_LOADER_MODE_IN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
                <name>USER_RAM_MODE_INTER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
                <name>USER_FLASH_MODE_INT</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MAP</name>
          </field>
        </fields>
        <name>SYSMEMREMAP</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x2</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>Peripheral reset control</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SPI0 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Resets the SPI0 peripheral.</description>
                <name>SPIO0RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>SPI0 reset de-asserted.</description>
                <name>SPIO0NORESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SSP0_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>I2C reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Resets the I2C peripheral.</description>
                <name>I2CRESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>I2C reset de-asserted.</description>
                <name>I2CNORESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>I2C_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SPI1 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Resets the SPI1 peripheral.</description>
                <name>SPI1RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>SPI1 reset de-asserted.</description>
                <name>SPI2NORESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SSP1_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>C_CAN reset control. See Section 3.1 for part specific details.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Resets the C_CAN peripheral.</description>
                <name>CANRESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>C_CAN reset de-asserted.</description>
                <name>CANNORESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CAN_RST_N</name>
          </field>
        </fields>
        <name>PRESETCTRL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
