ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8</addressOffset>
        <description>System PLL control</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 11111: Division ratio M = 32.</description>
            <name>MSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Post divider ratio P. The division ratio is 2 x P.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>P = 1</description>
                <name>P_EQ_1</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>P = 2</description>
                <name>P_EQ_2</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>P = 4</description>
                <name>P_EQ_4</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>P = 8</description>
                <name>P_EQ_8</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PSEL</name>
          </field>
        </fields>
        <name>SYSPLLCTRL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0xC</addressOffset>
        <description>System PLL status</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PLL lock status</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>PLL not locked</description>
                <name>PLL_NOT_LOCKED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>PLL locked</description>
                <name>PLL_LOCKED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>LOCK</name>
          </field>
        </fields>
        <name>SYSPLLSTAT</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x20</addressOffset>
        <description>System oscillator control</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bypass system oscillator</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Oscillator is not bypassed.</description>
                <name>NOBYPASS</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Bypass enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN and XTALOUT pins.</description>
                <name>BYPASS_ENABLED_PLL_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>BYPASS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Determines frequency range for Low-power oscillator.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>1 - 20 MHz frequency range.</description>
                <name>LOW</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>15 - 25 MHz frequency range</description>
                <name>HIGH</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FREQRANGE</name>
          </field>
        </fields>
        <name>SYSOSCCTRL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x24</addressOffset>
        <description>Watchdog oscillator control</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Select divider for Fclkana.  wdt_osc_clk = Fclkana/ (2 x (1 + DIVSEL)) 00000: 2 x (1 + DIVSEL) = 2 00001: 2 x (1 + DIVSEL) = 4 to 11111: 2 x (1 + DIVSEL) = 64</description>
            <name>DIVSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Select watchdog oscillator analog output frequency (Fclkana).</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>0.6 MHz</description>
                <name>0_6_MHZ</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>1.05 MHz</description>
                <name>1_05_MHZ</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>1.4 MHz</description>
                <name>1_4_MHZ</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>1.75 MHz</description>
                <name>1_75_MHZ</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2.1 MHz</description>
                <name>2_1_MHZ</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2.4 MHz</description>
                <name>2_4_MHZ</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2.7 MHz</description>
                <name>2_7_MHZ</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>3.0 MHz</description>
                <name>3_0_MHZ</name>
                <value>0x8</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>3.25 MHz</description>
                <name>3_25_MHZ</name>
                <value>0x9</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>3.5 MHz</description>
                <name>3_5_MHZ</name>
                <value>0xA</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>3.75 MHz</description>
                <name>3_75_MHZ</name>
                <value>0xB</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>4.0 MHz</description>
                <name>4_0_MHZ</name>
                <value>0xC</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>4.2 MHz</description>
                <name>4_2_MHZ</name>
                <value>0xD</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>4.4 MHz</description>
                <name>4_4_MHZ</name>
                <value>0xE</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>4.6 MHz</description>
                <name>4_6_MHZ</name>
                <value>0xF</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FREQSEL</name>
          </field>
        </fields>
        <name>WDTOSCCTRL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
