ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>IRC control</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Trim value</description>
            <name>TRIM</name>
          </field>
        </fields>
        <name>IRCCTRL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x80</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x30</addressOffset>
        <description>System reset status register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>POR reset status</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No POR detected.</description>
                <name>NO_POR_DETECTED_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>POR detected. Writing a one clears this reset.</description>
                <name>POR_DETECTED_WRITIN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>POR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status of the external RESET pin.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No RESET event detected.</description>
                <name>NO_RESET_EVENT_DETEC</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>RESET detected. Writing a one clears this reset.</description>
                <name>RESET_DETECTED_WRIT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>EXTRST</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status of the Watchdog reset</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No WDT reset detected.</description>
                <name>NO_WDT_RESET_DETECTE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>WDT reset detected. Writing a one clears this reset.</description>
                <name>WDT_RESET_DETECTED_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>WDT</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status of the Brown-out detect reset</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No BOD reset detected.</description>
                <name>NO_BOD_RESET_DETECTE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>BOD reset detected. Writing a one clears this reset.</description>
                <name>BOD_RESET_DETECTED_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>BOD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status of the software system reset</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No System reset detected.</description>
                <name>NO_SYSTEM_RESET_DETE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>System reset detected. Writing a one clears this reset.</description>
                <name>SYSTEM_RESET_DETECTE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SYSRST</name>
          </field>
        </fields>
        <name>SYSRSTSTAT</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x40</addressOffset>
        <description>System PLL clock source select</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>System PLL clock source</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>IRC oscillator</description>
                <name>IRC_OSCILLATOR</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>System oscillator</description>
                <name>SYSTEM_OSCILLATOR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved</description>
                <name>RESERVED</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved</description>
                <name>RESERVED</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SEL</name>
          </field>
        </fields>
        <name>SYSPLLCLKSEL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
