ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x234</addressOffset>
        <description>Power-down states after wake-up from Deep-sleep mode</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRC oscillator output wake-up configuration</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>IRCOUT_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRC oscillator power-down wake-up configuration</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>IRC_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Flash wake-up configuration</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FLASH_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>BOD wake-up configuration</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>BOD_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>ADC wake-up configuration</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ADC_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>System oscillator wake-up configuration</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SYSOSC_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Watchdog oscillator wake-up configuration</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>WDTOSC_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>System PLL wake-up configuration</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SYSPLL_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reserved. Always write this bit as 1.</description>
            <name>NOTUSED0</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reserved. Always write this bit as 0.</description>
            <name>NOTUSED1</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reserved. Always write this bit as 1.</description>
            <name>NOTUSED2</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reserved. Always write this bit as 1.</description>
            <name>NOTUSED3</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reserved. Always write this bit as 0.</description>
            <name>NOTUSED4</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xD</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Reserved. Always write these bits as 111.</description>
            <name>NOTUSED5</name>
          </field>
        </fields>
        <name>PDAWAKECFG</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xEDF0</resetValue>
        <size>0x20</size>
      </register>
