ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x3F4</addressOffset>
        <description>Device ID register 0 for parts  LPC1100C.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x20</bitWidth>
            <description>Part ID numbers  0x1421 102B = LPC11C12/FBD48/301 0x1440 102B = LPC11C14/FBD48/301 0x1431 102B = LPC11C22/FBD48/301 0X1430 102B = LPC11C24/FBD48/301</description>
            <name>DEVICEID</name>
          </field>
        </fields>
        <name>DEVICE_ID</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <addressBlock>
      <offset>0x0</offset>
      <size>0xFFF</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40050000</baseAddress>
    <description>C_CAN controller </description>
    <groupName>C_CAN</groupName>
    <interrupts>
      <interrupt>
        <name>C_CAN</name>
        <value>0xD</value>
      </interrupt>
    </interrupts>
    <name>C_CAN</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>CAN control</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Initialization</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Normal operation.</description>
                <name>NORMAL_OPERATION</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Initialization is started. On reset, software needs to initialize the CAN controller.</description>
                <name>INITIALIZATION_IS_ST</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>INIT</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Module interrupt enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable CAN interrupts. The interrupt line is always HIGH.</description>
                <name>DISABLE_CAN_INTERRUP</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable CAN interrupts. The interrupt line is set to LOW and remains LOW until all pending interrupts are cleared.</description>
                <name>ENABLE_CAN_INTERRUPT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>IE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status change interrupt enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable status change interrupts. No status change interrupt will be generated.</description>
                <name>DISABLE_STATUS_CHANG</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable status change interrupts. A status change interrupt will be generated when a message transfer is successfully completed or a CAN bus error is detected.</description>
                <name>ENABLE_STATUS_CHANGE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Error interrupt enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable error interrupt. No error status interrupt will be generated.</description>
                <name>DISABLE_ERROR_INTERR</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable error interrupt. A change in the bits BOFF or EWARN in the CANSTAT registers will generate an interrupt.</description>
                <name>ENABLE_ERROR_INTERRU</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>EIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Disable automatic retransmission</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Automatic retransmission of disturbed messages enabled.</description>
                <name>AUTOMATIC_RETRANSMIS</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Automatic retransmission disabled.</description>
                <name>AUTOMATIC_RETRANSMIS</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DAR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Configuration change enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>The CPU has no write access to the bit timing register.</description>
                <name>THE_CPU_HAS_NO_WRITE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>The CPU has write access to the CANBT register while the INIT bit is one.</description>
                <name>THE_CPU_HAS_WRITE_AC</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CCE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Test mode enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Normal operation.</description>
                <name>NORMAL_OPERATION</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Test mode.</description>
                <name>TEST_MODE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ENUM</name>
          </field>
        </fields>
        <name>CANCNTL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
