ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>Status register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Last error code Type of the last error to occur on the CAN bus.The LEC field holds a code which indicates the type of the last error to occur on the CAN bus. This field will be cleared to 0 when a message has been transferred (reception or transmission) without error. The unused code 111 may be written by the CPU to check for updates.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No error.</description>
                <name>NO_ERROR</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Stuff error: More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.</description>
                <name>STUFF_ERROR_MORE_TH</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Form error: A fixed format part of a received frame has the wrong format.</description>
                <name>FORM_ERROR_A_FIXED</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>AckError: The message this CAN core transmitted was not acknowledged.</description>
                <name>ACKERROR_THE_MESSAG</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Bit1Error: During the transmission of a message (with the exception of the arbitration field), the device wanted to send a HIGH/recessive level (bit of logical value 1), but the monitored bus value was LOW/dominant.</description>
                <name>BIT1ERROR_DURING_TH</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Bit0Error: During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a LOW/dominant level (data or identifier bit logical value 0), but the monitored Bus value was HIGH/recessive. During busoff recovery this status is set each time a sequence of 11 HIGH/recessive bits has been monitored. This enables the CPU to monitor the proceeding of the busoff recovery sequence (indicating the bus is not stuck at LOW/dominant or continuously disturbed).</description>
                <name>BIT0ERROR_DURING_TH</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>CRCError: The CRC checksum was incorrect in the message received.</description>
                <name>CRCERROR_THE_CRC_CH</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unused: No CAN bus event was detected (written by the CPU).</description>
                <name>UNUSED_NO_CAN_BUS_E</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>LEC</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmitted a message successfully This bit must be reset by the CPU. It is never reset by the CAN controller.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No transmit. Since this bit was last reset by the CPU, no message has been successfully transmitted.</description>
                <name>NO_TRANSMIT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Successful transmit. Since this bit was last reset by the CPU, a message has been successfully transmitted (error free and acknowledged by at least one other node).</description>
                <name>SUCCESSFUL_TRANSMIT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>TXOK</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Received a message successfully This bit must be reset by the CPU. It is never reset by the CAN controller.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No receive. Since this bit was last reset by the CPU, no message has been successfully received.</description>
                <name>NO_RECEIVE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Successful receive.Since this bit was last set to zero by the CPU, a message has been successfully received independent of the result of acceptance filtering.</description>
                <name>SUCCESSFUL_RECEIVE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RXOK</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Error passive</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Active. The CAN controller is in the error active state.</description>
                <name>ACTIVE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Passive. The CAN controller is in the error passive state as defined in the CAN 2.0 specification.</description>
                <name>PASSIVE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>EPASS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Warning status</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Below limit. Both error counters are below the error warning limit of 96.</description>
                <name>BELOW_LIMIT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>At limit. At least one of the error counters in the EC has reached the error warning limit of 96.</description>
                <name>AT_LIMIT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>EWARN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Busoff status</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>The CAN module is not in busoff.</description>
                <name>THE_CAN_MODULE_IS_NO</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>The CAN controller is in busoff state.</description>
                <name>THE_CAN_CONTROLLER_I</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>BOFF</name>
          </field>
        </fields>
        <name>CANSTAT</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
