ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x8</addressOffset>
        <description>Error counter</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Transmit error counter Current value of the transmit error counter (maximum value 255)</description>
            <name>TEC7_0</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x7</bitWidth>
            <description>Receive error counter Current value of the receive error counter (maximum value 127).</description>
            <name>REC6_0</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Receive error passive</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>The receive counter is below the error passive level.</description>
                <name>THE_RECEIVE_COUNTER</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>The receive counter has reached the error passive level as defined in the  CAN2.0 specification.</description>
                <name>THE_RECEIVE_COUNTER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RP</name>
          </field>
        </fields>
        <name>CANEC</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <description>Bit timing register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x6</bitWidth>
            <description>Baud rate prescaler The value by which the oscillator frequency is divided for generating the bit time quanta. The bit time is built up from a multiple of this quanta. Valid values for the Baud Rate Prescaler are 0 to 63.[1]</description>
            <name>BRP</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>(Re)synchronization jump width Valid programmed values are 0 to 3.[1]</description>
            <name>SJW</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Time segment before the sample point Valid values are 1 to 15.[1]</description>
            <name>TSEG1</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Time segment after the sample point Valid values are 0 to 7.[1]</description>
            <name>TSEG2</name>
          </field>
        </fields>
        <name>CANBT</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x2301</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x10</addressOffset>
        <description>Interrupt register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x10</bitWidth>
            <description>0x0000 = No interrupt is pending. 0x0001 - 0x0020 = Number of message object which caused the interrupt. 0x0021 - 0x7FFF = Unused 0x8000 = Status interrupt 0x8001 - 0xFFFF = Unused</description>
            <name>INTID</name>
          </field>
        </fields>
        <name>CANINT</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x14</addressOffset>
        <description>Test register</description>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Basic mode</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disabled. Basic mode disabled.</description>
                <name>DISABLED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enabled. IF1 registers used as TX buffer, IF2 registers used as RX buffer.</description>
                <name>ENABLED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>BASIC</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Silent mode</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Normal operation.</description>
                <name>NORMAL_OPERATION</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Silent mode. The module is in silent mode.</description>
                <name>SILENT_MODE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SILENT</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Loop back mode</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disabled. Loop back mode is disabled.</description>
                <name>DISABLED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enabled. Loop back mode is enabled.</description>
                <name>ENABLED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>LBACK</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Control of CAN_TXD pins</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Controller. Level at the CAN_TXD pin is controlled by the CAN controller. This is the value at reset.</description>
                <name>CONTROLLER</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Sample point. The sample point can be monitored at the CAN_TXD pin.</description>
                <name>SAMPLE_POINT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Low. CAN_TXD pin is driven LOW/dominant.</description>
                <name>LOW</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Hogh. CAN_TXD pin is driven HIGH/recessive.</description>
                <name>HOGH</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>TX</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Monitors the actual value of the CAN_RXD pin.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Recessive. The CAN bus is recessive (CAN_RXD = 1).</description>
                <name>RECESSIVE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Dominant. The CAN bus is dominant (CAN_RXD = 0).</description>
                <name>DOMINANT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RX</name>
          </field>
        </fields>
        <name>CANTEST</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
