ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x84</addressOffset>
        <description>Message interface 1 command mask (write direction)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access data bytes 4-7</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. Data bytes 4-7 unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Transfer. Transfer data bytes 4-7 to message object.</description>
                <name>TRANSFER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DATA_B</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access data bytes 0-3</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. Data bytes 0-3 unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Transfer. Transfer data bytes 0-3 to message object.</description>
                <name>TRANSFER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DATA_A</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access transmission request bit</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No transmission request. TXRQSRT bit unchanged in IF1/2_MCTRL. If a transmission is requested by programming this bit, the TXRQST bit in the CANIFn_MCTRL register is ignored.</description>
                <name>NO_TRANSMISSION_REQU</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Request a transmission. Set the TXRQST bit IF1/2_MCTRL.</description>
                <name>REQUEST_A_TRANSMISSI</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>TXRQST</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is ignored in the write direction.</description>
            <name>CLRINTPND</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access control bits</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. Control bits unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Transfer. Transfer control bits to message object</description>
                <name>TRANSFER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CTRL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access arbitration bits</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. Arbitration bits unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Transfer. Transfer Identifier, DIR, XTD, and MSGVAL bits to message object.</description>
                <name>TRANSFER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ARB</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access mask bits</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. Mask bits unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Transfer. Transfer Identifier MASK + MDIR + MXTD to message object.</description>
                <name>TRANSFER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MASK</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Write transfer Transfer data from the selected message buffer registers to the message object addressed by the command request register CANIFn_CMDREQ.</description>
            <name>WR_RD</name>
          </field>
        </fields>
        <name>CANIF2_CMDMSK_W</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
