ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x24</addressOffset>
        <description>Message interface 1 command mask (read direction)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access data bytes 4-7</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. Data bytes 4-7 unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Transfer. Transfer data bytes 4-7 to IFx message buffer register.</description>
                <name>TRANSFER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DATA_B</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access data bytes 0-3</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. Data bytes 0-3 unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Transfer. Transfer data bytes 0-3 to IFx message buffer.</description>
                <name>TRANSFER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DATA_A</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access new data bit</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. NEWDAT bit remains unchanged. A read access to a message object can be combined with the reset of the control bits INTPND and NEWDAT in IF1/2_MCTRL. The values of these bits transferred to the IFx Message Control Register always reflect the status before resetting these bits.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear. Clear NEWDAT bit in the message object.</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>NEWDAT</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear interrupt pending bit.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. INTPND bit remains unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear. Clear INTPND bit in the message object.</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CLRINTPND</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access control bits</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. Control bits unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Transfer. Transfer control bits to IFx message buffer.</description>
                <name>TRANSFER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CTRL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access arbitration bits</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. Arbitration bits unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Transfer. Transfer Identifier, DIR, XTD, and MSGVAL bits to IFx message buffer register.</description>
                <name>TRANSFER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ARB</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Access mask bits</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Unchanged. Mask bits unchanged.</description>
                <name>UNCHANGED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Transfer. Transfer Identifier MASK + MDIR + MXTD to IFx message buffer register.</description>
                <name>TRANSFER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MASK</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read transfer Transfer data from the message object addressed by the command request register to the selected message buffer registers CANIFn_CMDREQ.</description>
            <name>WR_RD</name>
          </field>
        </fields>
        <name>CANIF1_CMDMSK_R</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
