ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>Message interface 1 mask 1</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x10</bitWidth>
            <description>Identifier mask [15:0]</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Match. The corresponding bit in the identifier of the message cannot inhibit the match in the acceptance filtering.</description>
                <name>MATCH</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Mask. The corresponding identifier bit is used for acceptance filtering.</description>
                <name>MASK</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MSK15_0</name>
          </field>
        </fields>
        <name>CANIF1_MSK1</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFFFF</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x88</addressOffset>
        <description>Message interface 1 mask 1</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x10</bitWidth>
            <description>Identifier mask [15:0]</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Match. The corresponding bit in the identifier of the message cannot inhibit the match in the acceptance filtering.</description>
                <name>MATCH</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Mask. The corresponding identifier bit is used for acceptance filtering.</description>
                <name>MASK</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MSK15_0</name>
          </field>
        </fields>
        <name>CANIF2_MSK1</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFFFF</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x2C</addressOffset>
        <description>Message interface 1 mask 2</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0xD</bitWidth>
            <description>Identifier mask [28:16]</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Match. The corresponding bit in the identifier of the message cannot inhibit the match in the acceptance filtering.</description>
                <name>MATCH</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Mask. The corresponding identifier bit is used for acceptance filtering.</description>
                <name>MASK</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MSK28_16</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Mask message direction</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Without DIR bit. The message direction bit (DIR) has no effect on acceptance filtering.</description>
                <name>WITHOUT_DIR_BIT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>With DIR bit. The message direction bit (DIR) is used for acceptance filtering.</description>
                <name>WITH_DIR_BIT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MDIR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Mask extend identifier</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Without XTD. The extended identifier bit (XTD) has no effect on acceptance filtering.</description>
                <name>WITHOUT_XTD</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>With XTD. The extended identifier bit (XTD) is used for acceptance filtering.</description>
                <name>WITH_XTD</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MXTD</name>
          </field>
        </fields>
        <name>CANIF1_MSK2</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFFFF</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8C</addressOffset>
        <description>Message interface 1 mask 2</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0xD</bitWidth>
            <description>Identifier mask [28:16]</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Match. The corresponding bit in the identifier of the message cannot inhibit the match in the acceptance filtering.</description>
                <name>MATCH</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Mask. The corresponding identifier bit is used for acceptance filtering.</description>
                <name>MASK</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MSK28_16</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Mask message direction</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Without DIR bit. The message direction bit (DIR) has no effect on acceptance filtering.</description>
                <name>WITHOUT_DIR_BIT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>With DIR bit. The message direction bit (DIR) is used for acceptance filtering.</description>
                <name>WITH_DIR_BIT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MDIR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Mask extend identifier</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Without XTD. The extended identifier bit (XTD) has no effect on acceptance filtering.</description>
                <name>WITHOUT_XTD</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>With XTD. The extended identifier bit (XTD) is used for acceptance filtering.</description>
                <name>WITH_XTD</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MXTD</name>
          </field>
        </fields>
        <name>CANIF2_MSK2</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFFFF</resetValue>
      </register>
