ItaySharon/cmsis-svd/data/NXP/LPC11Cxx_v9.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x30</addressOffset>
        <description>Message interface 1 arbitration 1</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x10</bitWidth>
            <description>Message identifier [15:0] 29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
            <name>ID15_0</name>
          </field>
        </fields>
        <name>CANIF1_ARB1</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x90</addressOffset>
        <description>Message interface 1 arbitration 1</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x10</bitWidth>
            <description>Message identifier [15:0] 29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
            <name>ID15_0</name>
          </field>
        </fields>
        <name>CANIF2_ARB1</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x34</addressOffset>
        <description>Message interface 1 arbitration 2</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0xD</bitWidth>
            <description>Message identifier  29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
            <name>ID28_16</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xD</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Message direction</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Receive. On TXRQST, a Remote Frame with the identifier of this Message Object is transmitted. On reception of a Data Frame with matching identifier, that message is stored in this Message Object.</description>
                <name>RECEIVE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Tansmit. On TXRQST, the respective Message Object is transmitted as a Data Frame. On reception of a Remote Frame with matching identifier, the TXRQST bit of this Message Object is set (if RMTEN = one).</description>
                <name>TANSMIT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DIR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Extend identifier</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Standard. The 11-bit standard identifier will be used for this message object.</description>
                <name>STANDARD</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Extended. The 29-bit extended identifier will be used for this message object.</description>
                <name>EXTENDED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>XTD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Message valid The CPU must reset the MSGVAL bit of all unused Messages Objects during the initialization before it resets bit INIT in the CAN Control Register. This bit must also be reset before the identifier ID28:0, the control bits XTD, DIR, or the Data Length Code DLC3:0 are modified, or if the Messages Object is no longer required.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Invalid. The message object is ignored by the message handler.</description>
                <name>INVALID</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Valid. The message object is configured and should be considered by the message handler.</description>
                <name>VALID</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MSGVAL</name>
          </field>
        </fields>
        <name>CANIF1_ARB2</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x94</addressOffset>
        <description>Message interface 1 arbitration 2</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0xD</bitWidth>
            <description>Message identifier  29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
            <name>ID28_16</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xD</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Message direction</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Receive. On TXRQST, a Remote Frame with the identifier of this Message Object is transmitted. On reception of a Data Frame with matching identifier, that message is stored in this Message Object.</description>
                <name>RECEIVE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Tansmit. On TXRQST, the respective Message Object is transmitted as a Data Frame. On reception of a Remote Frame with matching identifier, the TXRQST bit of this Message Object is set (if RMTEN = one).</description>
                <name>TANSMIT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DIR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Extend identifier</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Standard. The 11-bit standard identifier will be used for this message object.</description>
                <name>STANDARD</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Extended. The 29-bit extended identifier will be used for this message object.</description>
                <name>EXTENDED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>XTD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Message valid The CPU must reset the MSGVAL bit of all unused Messages Objects during the initialization before it resets bit INIT in the CAN Control Register. This bit must also be reset before the identifier ID28:0, the control bits XTD, DIR, or the Data Length Code DLC3:0 are modified, or if the Messages Object is no longer required.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Invalid. The message object is ignored by the message handler.</description>
                <name>INVALID</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Valid. The message object is configured and should be considered by the message handler.</description>
                <name>VALID</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MSGVAL</name>
          </field>
        </fields>
        <name>CANIF2_ARB2</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
